a13568066467-hash/AI-law-enforcement/firmware/sdkconfig.defaults
# Seeed XIAO ESP32S3 Sense (16MB Flash + PSRAM)
CONFIG_IDF_TARGET="esp32s3"

CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# PSRAM（OV5640 JPEG 缓冲）
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# BLE（后续 ble_service.c）
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# FSM 逻辑自测（串口 17/17）；量产可关
CONFIG_FSM_SELF_TEST=y

# 板级硬件自检（引脚/ADC/双麦/相机）
CONFIG_BOARD_SELFTEST_ENABLE=y

# 双麦 + 喇叭 + OV5640
CONFIG_AUDIO_OUT_ENABLE=y
CONFIG_AUDIO_IN_ENABLE=y
CONFIG_CAMERA_ENABLE=y

# 电量：先 ≤15% 提醒，再 ≤10% 禁开录/AI
CONFIG_BATTERY_MONITOR_ENABLE=y
CONFIG_BATTERY_LOW_ALERT_PERCENT=15
CONFIG_BATTERY_RECORD_MIN_PERCENT=10
CONFIG_BATTERY_ALERT_INTERVAL_SEC=120
CONFIG_BATTERY_SAMPLE_PERIOD_MS=5000
CONFIG_BATTERY_USE_MOCK=n

# 边充边录：TP4056 CHRG → GPIO5 (XIAO D4)
CONFIG_CHARGE_DETECT_ENABLE=y
CONFIG_CHARGE_ALLOW_RECORD_WHILE_PLUGGED=y
CONFIG_CHARGE_SKIP_LOW_PROTECT=y
CONFIG_CHARGE_USE_MOCK=n

# 待机续航
CONFIG_STANDBY_MGR_ENABLE=y
CONFIG_STANDBY_AI_LISTEN_IDLE_SEC=5
CONFIG_STANDBY_IDLE_TIMEOUT_SEC=300
CONFIG_STANDBY_LIGHT_SLEEP_ENABLE=n
CONFIG_STANDBY_POLL_MS=1000
